Revit 2026 API

# IFCGuidKey(String) Constructor

---

Constructs a new IFCHybridGuid

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCGuidKey(
	string ifcGuid
)
```
```vb
Public Sub New (
	ifcGuid As String
)
```
```cpp
public:
IFCGuidKey(
	String^ ifcGuid
)
```
```fsharp
new :
        ifcGuid : string -> IFCGuidKey
```

#### Parameters

ifcGuid String
     IFC Global ID

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCGuidKey Class

IFCGuidKey Overload

Autodesk.Revit.DB.IFC Namespace